Autodesk.Revit.CloudProjectInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.CloudProjectInfo.ProjectVersion
Project version.
Since:
2019

Autodesk.Revit.CloudProjectInfo.ProjectGuid
Project Guid from C4R.
Since:
2019

Autodesk.Revit.CloudProjectInfo.ProjectName
Project name.
Since:
2019

Autodesk.Revit.CloudProjectInfo.ProjectId
Project identity in BIM 360 Docs or Autodesk Docs.
Since:
2019

Autodesk.Revit.CloudProjectInfo.Region
Account region in AWS.
Since:
2019

Autodesk.Revit.CloudProjectInfo.HubId
Hub identity in BIM 360 Docs or Autodesk Docs.
Since:
2019

Autodesk.Revit.CloudProjectInfo.#ctor
Since:
2019

Autodesk.Revit.CloudProjectInfo
The data that can be provided to the CloudExternalService.
Since:
2019